"Volume" = "Volym"; 
"Drawbars" = "Dragreglage"; 
"Percussion Level" = "Slagverkets nivå"; 
"Percussion Time" = "Slagverkets tid"; 
"Click" = "Klick"; 
"Distortion" = "Distorsion"; 
"Rotary Speaker" = "Roterande högtalare"; 


